<a href="https://colab.research.google.com/github/difo23/BitacorasDataScienceDominicano/blob/master/curso_platzi_class_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Series e Indexación y selección de datos

In [ ]:
import numpy as np # Import numpy and pandas library for the projects

In [ ]:
import pandas as pd

In [ ]:
# This a simply array of number 
np.array([2,3,4,5,1])

array([2, 3, 4, 5, 1])

In [ ]:
# Create series with pandas, this have index columns 
sr = pd.Series([2,3,4,5,1])
sr

0    2
1    3
2    4
3    5
4    1
dtype: int64

In [ ]:
# Show values
sr.values

array([2, 3, 4, 5, 1])

In [ ]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
sr.shape

(5,)

In [ ]:
sr.all

<bound method Series.all of 0    2
1    3
2    4
3    5
4    1
dtype: int64>

In [ ]:
# Can chage the index of series pandas
sr = pd.Series([8,7,2,3,4,5], index= ['a','b','c','d','f','g'])

a    8
b    7
c    2
d    3
f    4
g    5
dtype: int64

In [ ]:
# The dictionaries can become pandas series.
dic_data = {'MX':100,'AR':200,'PR':300}
dic_data

{'AR': 200, 'MX': 100, 'PR': 300}

In [ ]:
pd.__version__

'1.1.5'

In [ ]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [ ]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [ ]:
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])

In [ ]:
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [ ]:
# Show the columns
df[['cm','pais']]

           cm pais
ana       115   co
benito    110   mx
camilo    130   co
daniel    155   mx
erika     125   mx
fabian    120   ch
gabriela  125   ch

In [ ]:
df.loc['ana',['cm','edad']]

cm      115
edad     10
Name: ana, dtype: object

In [ ]:
df.loc[['ana', 'erika'],['cm','edad']] # Return ana and erika age and cm

        cm  edad
ana    115    10
erika  125    12

In [ ]:
df.loc['ana','cm'] # Return 115 value in the cell match with row ana and column cm

115

In [ ]:
df.iloc[0,1] # Is the same! More fast only need the number of [row, column] (this start in 0, 0)

115

In [ ]:
df.iloc[0,[1,3]]

cm        115
genero      M
Name: ana, dtype: object

In [ ]:
df.iloc[:,[1,3]]

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriela  125      F

In [ ]:
df.iloc[0,range(3)]

edad     10
cm      115
pais     co
Name: ana, dtype: object

## Function Query in DataFrames with pandas

In [ ]:
df.query('cm > 130 ')

        edad   cm pais genero  Q1  Q2
daniel    14  155   mx      M NaN   8

In [ ]:
df[(df['edad'] >= 12) & (df['pais'] == 'mx')] # operator & is and

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

Hello Google Drive!

In [ ]:
df.query('(edad >= 12) and (pais == "mx")') # operator and, this is the same of before

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

## Conect with drive and load csv

In [ ]:
from google.colab import drive
drive.mount('/gdrive')

Mounted at /gdrive

In [ ]:
%cd '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db'

/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db

In [ ]:
!ls

API_AG.LND.AGRI.K2_DS2_en_csv_v2_716226.csv	Meteorite_Landings.csv
API_AG.LND.FRST.K2_DS2_en_csv_v2_716262.csv	poblacion.csv
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_715482.csv	test.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_713263.csv	test.hdf
API_SP.POP.TOTL_DS2_en_csv_v2_713131.csv	test.json
covid_19_data.csv				test.parquet
flights.db					test.pkl
GlobalLandTemperaturesByCountry.csv		test.xlsx
london_merged.csv

In [ ]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.csv')

In [ ]:
dir_pandas

'/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/test_lizandro.csv'

### Save DataFrame in csv

In [ ]:
df.to_csv(dir_pandas)

In [ ]:
!ls

API_AG.LND.AGRI.K2_DS2_en_csv_v2_716226.csv	Meteorite_Landings.csv
API_AG.LND.FRST.K2_DS2_en_csv_v2_716262.csv	poblacion.csv
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_715482.csv	test.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_713263.csv	test.hdf
API_SP.POP.TOTL_DS2_en_csv_v2_713131.csv	test.json
covid_19_data.csv				test_lizandro.csv
flights.db					test.parquet
GlobalLandTemperaturesByCountry.csv		test.pkl
london_merged.csv				test.xlsx

In [ ]:
!cat test_lizandro.csv

,edad,cm,pais,genero,Q1,Q2
ana,10,115,co,M,5.0,7
benito,9,110,mx,F,10.0,9
camilo,13,130,co,F,8.0,9
daniel,14,155,mx,M,,8
erika,12,125,mx,M,7.0,8
fabian,11,120,ch,M,8.0,8
gabriela,12,125,ch,F,3.0,9

In [ ]:
df.to_csv(dir_pandas, index= True) # Yo can add index with True, False otherwise

In [ ]:
!cat test_lizandro.csv

,edad,cm,pais,genero,Q1,Q2
ana,10,115,co,M,5.0,7
benito,9,110,mx,F,10.0,9
camilo,13,130,co,F,8.0,9
daniel,14,155,mx,M,,8
erika,12,125,mx,M,7.0,8
fabian,11,120,ch,M,8.0,8
gabriela,12,125,ch,F,3.0,9

In [ ]:
df_read_drive = pd.read_csv(dir_pandas)
df_read_drive

  Unnamed: 0  edad   cm pais genero    Q1  Q2
0        ana    10  115   co      M   5.0   7
1     benito     9  110   mx      F  10.0   9
2     camilo    13  130   co      F   8.0   9
3     daniel    14  155   mx      M   NaN   8
4      erika    12  125   mx      M   7.0   8
5     fabian    11  120   ch      M   8.0   8
6   gabriela    12  125   ch      F   3.0   9

In [ ]:
df.to_csv(dir_pandas, sep= '|', index= False) # You can change the separator with sep

In [ ]:
!cat test_lizandro.csv

edad|cm|pais|genero|Q1|Q2
10|115|co|M|5.0|7
9|110|mx|F|10.0|9
13|130|co|F|8.0|9
14|155|mx|M||8
12|125|mx|M|7.0|8
11|120|ch|M|8.0|8
12|125|ch|F|3.0|9

In [ ]:
df_read_drive = pd.read_csv(dir_pandas, sep='|')
df_read_drive

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

### Use progresSQL in the notebook

In [ ]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /usr/local/lib/python3.7/dist-packages (2.8.6)

In [ ]:
import pandas as pd
import psycopg2

In [ ]:
!apt install postgresql postgresql-contrib &>log

In [ ]:
!service postgresql start

 * Starting PostgreSQL 10 database server
   ...done.

In [ ]:
!sudo -u postgres psql -c "CREATE USER root WITH SUPERUSER"

CREATE ROLE

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%config SqlMagic.feedback=False

In [ ]:
%config SqlMagic.autopandas=True

In [ ]:
%sql postgresql+psycopg2://@/postgres

'Connected: @postgres'

In [ ]:
query_sql = '''
select *
from pg_catalog.pg_tables
limit 10
'''

In [ ]:
df = %sql $query_sql

 * postgresql+psycopg2://@/postgres

In [ ]:
df.head(10)

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

# Work with excel

In [ ]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.xlsx')

In [ ]:
df.to_excel(dir_pandas, index=False, sheet_name='platzi') # Save is with DataFrame

In [ ]:
pd.read_excel(dir_pandas) # Read is with pandas

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Format JSON

In [ ]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.json')

In [ ]:
df.to_json(dir_pandas, indent=False) # Save is with DataFrame

In [ ]:
pd.read_json(dir_pandas) # Read is with pandas

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Format pickle binary

In [ ]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.pkl')

In [ ]:
df.to_pickle(dir_pandas) # Save is with DataFrame

In [ ]:
pd.read_pickle(dir_pandas) # Save is with DataFrame

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Format parquet and hdf form apache, big data and Hadoop

In [ ]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.parquet')

In [ ]:
df.to_parquet(dir_pandas) # Save is with DataFrame

In [ ]:
pd.read_parquet(dir_pandas)

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

In [ ]:
dir_pandas = '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db/{}'.format('test_lizandro.h5')

Note: HDF is now .h5

In [ ]:
df.to_hdf(dir_pandas, key='data', format='table') # Save is with DataFrame

In [ ]:
pd.read_hdf(dir_pandas)

   schemaname        tablename tableowner  ... hasrules  hastriggers  rowsecurity
0  pg_catalog     pg_statistic   postgres  ...    False        False        False
1  pg_catalog          pg_type   postgres  ...    False        False        False
2  pg_catalog        pg_policy   postgres  ...    False        False        False
3  pg_catalog        pg_authid   postgres  ...    False        False        False
4  pg_catalog  pg_user_mapping   postgres  ...    False        False        False
5  pg_catalog  pg_subscription   postgres  ...    False        False        False
6  pg_catalog     pg_attribute   postgres  ...    False        False        False
7  pg_catalog          pg_proc   postgres  ...    False        False        False
8  pg_catalog         pg_class   postgres  ...    False        False        False
9  pg_catalog       pg_attrdef   postgres  ...    False        False        False

[10 rows x 8 columns]

## Work with [Google dataset search ](https://datasetsearch.research.google.com/)

In [ ]:
%cd '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db'

/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db

In [ ]:
!ls # Need to move

API_AG.LND.AGRI.K2_DS2_en_csv_v2_716226.csv	test.hdf
API_AG.LND.FRST.K2_DS2_en_csv_v2_716262.csv	test.json
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_715482.csv	test_lizandro.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_713263.csv	test_lizandro.h5
API_SP.POP.TOTL_DS2_en_csv_v2_713131.csv	test_lizandro.hdf
covid_19_data.csv				test_lizandro.json
flights.db					test_lizandro.parquet
GlobalLandTemperaturesByCountry.csv		test_lizandro.pkl
london_merged.csv				test_lizandro.xlsx
Meteorite_Landings.csv				test.parquet
poblacion.csv					test.pkl
test.csv					test.xlsx

In [ ]:
import pandas as pd

In [ ]:
df_meteorite = pd.read_csv('./Meteorite_Landings.csv')

In [ ]:
df_meteorite.sample(10) # take a sample random from the table

                          name     id  ... reclong             GeoLocation
12407  Frontier Mountain 95006  10691  ...   160.4  (-72.96528, 160.43111)
879        San Pedro de Quiles  23130  ...   -71.4      (-31.01667, -71.4)
30509    Northwest Africa 7488  56311  ...     0.0              (0.0, 0.0)
1383                 Acfer 268    276  ...     3.9     (27.51389, 3.87528)
19122    Larkman Nunatak 06278  49554  ...     0.0              (0.0, 0.0)
774                   Pavlovka  18177  ...    43.0        (52.03333, 43.0)
42063            Yamato 793406  28755  ...    35.7       (-71.5, 35.66667)
29678    Northwest Africa 6095  51504  ...     0.0              (0.0, 0.0)
2767        Allan Hills A78026   1642  ...   159.7  (-76.71667, 159.66667)
8803        Finger Ridge 01601  10098  ...     nan                     NaN

[10 rows x 10 columns]

In [ ]:
df_meteorite.shape # (rows, columns)

(45716, 10)

In [ ]:
df_meteorite.size # rows * columns

457160

In [ ]:
df_meteorite.describe() # Data statistics from my number type columns

            id     mass (g)   reclat  reclong
count 45,716.0     45,585.0 38,401.0 38,401.0
mean  26,889.7     13,278.1    -39.1     61.1
std   16,860.7    574,988.9     46.4     80.6
min        1.0          0.0    -87.4   -165.4
25%   12,688.8          7.2    -76.7      0.0
50%   24,261.5         32.6    -71.5     35.7
75%   40,656.8        202.6      0.0    157.2
max   57,458.0 60,000,000.0     81.2    354.5

In [ ]:
pd.options.display.float_format = '{:,.1f}'.format # change the notation format in the discribe function

In [ ]:
df_meteorite.describe(include='all') # Data statistics from my number and text type columns

                       name       id nametype  ...   reclat  reclong GeoLocation
count                 45716 45,716.0    45716  ... 38,401.0 38,401.0       38401
unique                45716      nan        2  ...      nan      nan       17100
top     Miller Range 090422      nan    Valid  ...      nan      nan  (0.0, 0.0)
freq                      1      nan    45641  ...      nan      nan        6214
mean                    NaN 26,889.7      NaN  ...    -39.1     61.1         NaN
std                     NaN 16,860.7      NaN  ...     46.4     80.6         NaN
min                     NaN      1.0      NaN  ...    -87.4   -165.4         NaN
25%                     NaN 12,688.8      NaN  ...    -76.7      0.0         NaN
50%                     NaN 24,261.5      NaN  ...    -71.5     35.7         NaN
75%                     NaN 40,656.8      NaN  ...      0.0    157.2         NaN
max                     NaN 57,458.0      NaN  ...     81.2    354.5         NaN

[11 rows x 10 columns]

In [ ]:
df_meteorite.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [ ]:
df_meteorite.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [ ]:
df_meteorite[['fall', 'nametype']]= df_meteorite[['fall', 'nametype']].astype('category')

In [ ]:
df_meteorite.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

In [ ]:
df_meteorite['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [ ]:
df_meteorite['fall'].value_counts() # Frequency

Found    44609
Fell      1107
Name: fall, dtype: int64

In [ ]:
pd.get_dummies(df_meteorite['fall']) # create vars dummy very good for analytics, fall 1 or 0 and found 1 or 0

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

In [ ]:
df_meteorite[['fell', 'found']] = pd.get_dummies(df_meteorite['fall'])

In [ ]:
df_meteorite.tail(10)

             name     id nametype  ...             GeoLocation  fell found
45706     Zerkaly  31354    Valid  ...    (52.13333, 81.96667)     0     1
45707    Zhaoping  54609    Valid  ...   (24.23333, 111.18333)     0     1
45708    Zhigansk  30405    Valid  ...           (68.0, 128.3)     0     1
45709  Zhongxiang  30406    Valid  ...           (31.2, 112.5)     0     1
45710  Zillah 001  31355    Valid  ...       (29.037, 17.0185)     0     1
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[10 rows x 12 columns]

In [ ]:
# Create NaN if the number is not a type date
date_format= pd.to_datetime(
    df_meteorite['year'],
    errors = 'coerce', 
    format ='%m/%d/%Y %H:%M:%S %p'
)

date_format

0       1880-01-01 12:00:00
1       1951-01-01 12:00:00
2       1952-01-01 12:00:00
3       1976-01-01 12:00:00
4       1902-01-01 12:00:00
                ...
45711   1990-01-01 12:00:00
45712   1999-01-01 12:00:00
45713   1939-01-01 12:00:00
45714   2003-01-01 12:00:00
45715   1976-01-01 12:00:00
Name: year, Length: 45716, dtype: datetime64[ns]

In [ ]:
df_meteorite['year'] = date_format

In [ ]:
df_meteorite.tail(10)

             name     id nametype  ...             GeoLocation  fell found
45706     Zerkaly  31354    Valid  ...    (52.13333, 81.96667)     0     1
45707    Zhaoping  54609    Valid  ...   (24.23333, 111.18333)     0     1
45708    Zhigansk  30405    Valid  ...           (68.0, 128.3)     0     1
45709  Zhongxiang  30406    Valid  ...           (31.2, 112.5)     0     1
45710  Zillah 001  31355    Valid  ...       (29.037, 17.0185)     0     1
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[10 rows x 12 columns]

In [ ]:
df_meteorite.dtypes # Will have a new type of data datetime64

name                   object
id                      int64
nametype             category
recclass               object
mass_g                float64
fall                 category
year           datetime64[ns]
reclong               float64
GeoLocation            object
fell                    uint8
found                   uint8
dtype: object

In [ ]:
df_meteorite.rename(columns={'mass (g)':'mass_g'}, inplace=True) # change the name mass (g) by mass_g and save this with inplace in true

## All about delete columns, rows and register, extra correctly copy dataframare

In [ ]:
df_meteorite.drop(['reclat'], axis=1, inplace=True) # delete columns two optios in axis o for index or rows and 1 for columns

In [ ]:
df_meteorite.head(10)

                  name   id nametype  ...           GeoLocation  fell found
0               Aachen    1    Valid  ...     (50.775, 6.08333)     1     0
1               Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
2                 Abee    6    Valid  ...    (54.21667, -113.0)     1     0
3             Acapulco   10    Valid  ...     (16.88333, -99.9)     1     0
4              Achiras  370    Valid  ...   (-33.16667, -64.95)     1     0
5             Adhi Kot  379    Valid  ...          (32.1, 71.8)     1     0
6  Adzhi-Bogdo (stone)  390    Valid  ...  (44.83333, 95.16667)     1     0
7                 Agen  392    Valid  ...   (44.21667, 0.61667)     1     0
8               Aguada  398    Valid  ...    (-31.6, -65.23333)     1     0
9        Aguila Blanca  417    Valid  ...   (-30.86667, -64.55)     1     0

[10 rows x 11 columns]

In [ ]:
df_meteorite.drop([0,2,3,6], axis=0, inplace=True) # delete rows two optios in axis o for index or rows and 1 for columns

In [ ]:
df_meteorite.head(10)

                name   id nametype  ...           GeoLocation  fell found
1             Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
4            Achiras  370    Valid  ...   (-33.16667, -64.95)     1     0
5           Adhi Kot  379    Valid  ...          (32.1, 71.8)     1     0
7               Agen  392    Valid  ...   (44.21667, 0.61667)     1     0
8             Aguada  398    Valid  ...    (-31.6, -65.23333)     1     0
9      Aguila Blanca  417    Valid  ...   (-30.86667, -64.55)     1     0
10  Aioun el Atrouss  423    Valid  ...  (16.39806, -9.57028)     1     0
11               Aïr  424    Valid  ...   (19.08333, 8.38333)     1     0
12   Aire-sur-la-Lys  425    Valid  ...   (50.66667, 2.33333)     1     0
13             Akaba  426    Valid  ...     (29.51667, 35.05)     1     0

[10 rows x 11 columns]

In [ ]:
df_meteorite.drop(index=[1,4,10,11], columns=['name', 'recclass'], inplace=True)

In [ ]:
df_meteorite.head(10)

     id nametype   mass_g  fall  ... reclong           GeoLocation fell  found
5   379    Valid  4,239.0  Fell  ...    71.8          (32.1, 71.8)    1      0
7   392    Valid 30,000.0  Fell  ...     0.6   (44.21667, 0.61667)    1      0
8   398    Valid  1,620.0  Fell  ...   -65.2    (-31.6, -65.23333)    1      0
9   417    Valid  1,440.0  Fell  ...   -64.5   (-30.86667, -64.55)    1      0
12  425    Valid      nan  Fell  ...     2.3   (50.66667, 2.33333)    1      0
13  426    Valid    779.0  Fell  ...    35.0     (29.51667, 35.05)    1      0
14  427    Valid  1,800.0  Fell  ...    78.0     (29.71667, 77.95)    1      0
15  432    Valid  3,000.0  Fell  ...     8.4    (8.91667, 8.43333)    1      0
16  433    Valid 50,000.0  Fell  ...    42.8  (39.91667, 42.81667)    1      0
17  446    Valid    160.0  Fell  ...    39.5  (24.41667, 39.51667)    1      0

[10 rows x 9 columns]

In [ ]:
df_new = df_meteorite.copy(deep=True) # Deep is important for value copy and deep in false is copy by reference

In [ ]:
# It is recommended to always copy your origin data frame and work with this copy.

## Use apply for functions in the dataframe

In [1]:
def multiply(x):
  return x**2

In [2]:
%cd '/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db'

/content/drive/MyDrive/Colab_Notebooks/curso-manipulaciin-analisis-pandas-python/db-20210404T222125Z-001/db

In [3]:
import pandas as pd

In [4]:
df_meteorite = pd.read_csv('./Meteorite_Landings.csv')

In [5]:
df_meteorite.sample(10) # take a sample random from the table

                              name     id  ...    reclong             GeoLocation
20376            Lewis Cliff 86469  13399  ...  161.67689  (-84.27424, 161.67689)
24066       Meteorite Hills A78009  16605  ...  155.75000     (-79.68333, 155.75)
6281               Dar al Gani 509   6057  ...   16.06683    (27.26683, 16.06683)
5006                  Augustinovka   4898  ...   35.08333    (48.06667, 35.08333)
34559  Queen Alexandra Range 97926  21380  ...  168.00000          (-84.0, 168.0)
20862            Lewis Cliff 88130  13883  ...  161.44210   (-84.25048, 161.4421)
32123  Queen Alexandra Range 02148  18961  ...  168.00000          (-84.0, 168.0)
39037                 Yamato 74609  24987  ...   35.97778   (-71.73194, 35.97778)
26378                     New York  55760  ...    0.00000              (0.0, 0.0)
13747       Grove Mountains 020585  49788  ...   75.24722   (-72.98361, 75.24722)

[10 rows x 10 columns]

In [6]:
df = df_meteorite.copy(deep=True)

In [7]:
df['id'].apply(multiply)

0                1
1                4
2               36
3              100
4           136900
           ...
45711    983198736
45712    924707281
45713    924768100
45714    983261449
45715    925011396
Name: id, Length: 45716, dtype: int64

In [8]:
df.apply(lambda x: x['reclat']+x['reclong'],axis=1)

0        56.85833
1        66.41666
2       -58.78333
3       -83.01667
4       -98.11667
           ...
45711    46.05550
45712    22.75000
45713    66.91667
45714    91.29377
45715   -81.70000
Length: 45716, dtype: float64

In [9]:
df.applymap(lambda x: x*2)

                       name  ...                                   GeoLocation
0              AachenAachen  ...            (50.775, 6.08333)(50.775, 6.08333)
1              AarhusAarhus  ...      (56.18333, 10.23333)(56.18333, 10.23333)
2                  AbeeAbee  ...          (54.21667, -113.0)(54.21667, -113.0)
3          AcapulcoAcapulco  ...            (16.88333, -99.9)(16.88333, -99.9)
4            AchirasAchiras  ...        (-33.16667, -64.95)(-33.16667, -64.95)
...                     ...  ...                                           ...
45711  Zillah 002Zillah 002  ...            (29.037, 17.0185)(29.037, 17.0185)
45712          ZinderZinder  ...        (13.78333, 8.96667)(13.78333, 8.96667)
45713              ZlinZlin  ...            (49.25, 17.66667)(49.25, 17.66667)
45714    ZubkovskyZubkovsky  ...        (49.78917, 41.5046)(49.78917, 41.5046)
45715  Zulu QueenZulu Queen  ...  (33.98333, -115.68333)(33.98333, -115.68333)

[45716 rows x 10 columns]

In [10]:
!ls

API_AG.LND.AGRI.K2_DS2_en_csv_v2_716226.csv	test.hdf
API_AG.LND.FRST.K2_DS2_en_csv_v2_716262.csv	test.json
API_EG.USE.ELEC.KH.PC_DS2_en_csv_v2_715482.csv	test_lizandro.csv
API_EN.ATM.CO2E.KT_DS2_en_csv_v2_713263.csv	test_lizandro.h5
API_SP.POP.TOTL_DS2_en_csv_v2_713131.csv	test_lizandro.hdf
covid_19_data.csv				test_lizandro.json
flights.db					test_lizandro.parquet
GlobalLandTemperaturesByCountry.csv		test_lizandro.pkl
london_merged.csv				test_lizandro.xlsx
Meteorite_Landings.csv				test.parquet
poblacion.csv					test.pkl
test.csv					test.xlsx

In [11]:
df = pd.read_csv('./poblacion.csv')

In [12]:
df.head(10)

               Country  year         pop
0          Afghanistan  2015  34413603.0
1              Albania  2015   2880703.0
2              Algeria  2015  39728025.0
3       American Samoa  2015     55812.0
4              Andorra  2015     78011.0
5               Angola  2015  27884381.0
6  Antigua and Barbuda  2015     93566.0
7            Argentina  2015  43131966.0
8              Armenia  2015   2925553.0
9                Aruba  2015    104341.0

In [13]:
pd.options.display.float_format = '{:,.1f}'.format

## Multi-index

In [14]:
df['year'] = pd.Categorical(df['year'].apply(str))

In [15]:
df.dtypes

Country      object
year       category
pop         float64
dtype: object

In [19]:
idx_filtro = df['Country'].isin(['Aruba', 'Colombia']) # isin is a like a filter

In [24]:
df_sample=  df[idx_filtro]
df_sample

      Country  year          pop
9       Aruba  2015    104,341.0
42   Colombia  2015 47,520,667.0
269     Aruba  2016    104,872.0
302  Colombia  2016 48,171,392.0
529     Aruba  2017    105,366.0
562  Colombia  2017 48,901,066.0
789     Aruba  2018    105,845.0
822  Colombia  2018 49,648,685.0

In [25]:
df_sample= df_sample.set_index(['Country', 'year']).sort_index()
df_sample # Los multiples indexes nos permiten estructurar mejor los datos

                       pop
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [27]:
df_sample.loc['Colombia', :].loc['2016', :]

pop   48,171,392.0
Name: 2016, dtype: float64

In [30]:
df_sample.xs(['Colombia']) # Select Multi-index

              pop
year
2015 47,520,667.0
2016 48,171,392.0
2017 48,901,066.0
2018 49,648,685.0

In [61]:
df_countries = df.set_index(['Country', 'year']).sort_index(ascending = [True, True])
df_countries.head(10)

                          pop
Country     year
Afghanistan 2015 34,413,603.0
            2016 35,383,128.0
            2017 36,296,400.0
            2018 37,172,386.0
Albania     2015  2,880,703.0
            2016  2,876,101.0
            2017  2,873,457.0
            2018  2,866,376.0
Algeria     2015 39,728,025.0
            2016 40,551,404.0

In [66]:
ids= pd.IndexSlice

In [67]:
ids['Aruba':'Austria','2015':'2017']

(slice('Aruba', 'Austria', None), slice('2015', '2017', None))

In [68]:
df_countries.loc[ids['Aruba':'Austria','2015':'2017'], :].sort_index()

                        pop
Country   year
Aruba     2015    104,341.0
          2016    104,872.0
          2017    105,366.0
Australia 2015 23,815,995.0
          2016 24,190,907.0
          2017 24,601,860.0
Austria   2015  8,642,699.0
          2016  8,736,668.0
          2017  8,797,566.0

In [69]:
df_countries.index

MultiIndex([('Afghanistan', '2015'),
            ('Afghanistan', '2016'),
            ('Afghanistan', '2017'),
            ('Afghanistan', '2018'),
            (    'Albania', '2015'),
            (    'Albania', '2016'),
            (    'Albania', '2017'),
            (    'Albania', '2018'),
            (    'Algeria', '2015'),
            (    'Algeria', '2016'),
            ...
            ('Yemen, Rep.', '2017'),
            ('Yemen, Rep.', '2018'),
            (     'Zambia', '2015'),
            (     'Zambia', '2016'),
            (     'Zambia', '2017'),
            (     'Zambia', '2018'),
            (   'Zimbabwe', '2015'),
            (   'Zimbabwe', '2016'),
            (   'Zimbabwe', '2017'),
            (   'Zimbabwe', '2018')],
           names=['Country', 'year'], length=1040)

In [70]:
df_countries.index.get_level_values(0) #it returns the first level index, in this case are the countries

Index(['Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan', 'Albania',
       'Albania', 'Albania', 'Albania', 'Algeria', 'Algeria',
       ...
       'Yemen, Rep.', 'Yemen, Rep.', 'Zambia', 'Zambia', 'Zambia', 'Zambia',
       'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe'],
      dtype='object', name='Country', length=1040)

In [72]:
df_countries['pop']['Colombia']['2018']

49648685.0

In [74]:
df_countries

                          pop
Country     year
Afghanistan 2015 34,413,603.0
            2016 35,383,128.0
            2017 36,296,400.0
            2018 37,172,386.0
Albania     2015  2,880,703.0
...                       ...
Zambia      2018 17,351,822.0
Zimbabwe    2015 13,814,629.0
            2016 14,030,390.0
            2017 14,236,745.0
            2018 14,439,018.0

[1040 rows x 1 columns]

In [73]:
df_countries.sum(level='year') # Return the sum of population for each year

                  pop
year
2015 65,679,147,019.0
2016 66,487,930,677.0
2017 67,294,176,701.0
2018 68,087,886,692.0

## **Concatenate** DataFrames

In [76]:
import pandas as pd
import numpy as np

In [88]:
pd.options.display.float_format = '{:.2f}'.format

In [89]:
np.set_printoptions(precision=2)

In [92]:
x1 =np.random.rand(2,5)*100

In [94]:
x2 = np.random.randn(2,5)*100

In [100]:
x_concatenate = np.concatenate([x1,x2])

In [99]:
x_concatenate.shape

(4, 5)

In [103]:
s1 = pd.Series(x1[0], index=['a','b','c','d','e'])
s2 = pd.Series(x2[0], index=['c','d','g','f','h'])

In [104]:
pd.concat([s1,s2])

a     69.62
b     32.87
c     92.94
d     40.17
e     33.52
c   -100.93
d   -141.12
g      6.91
f     19.81
h     -8.54
dtype: float64

In [105]:
pd.concat([s1,s2], axis=1)

      0       1
a 69.62     nan
b 32.87     nan
c 92.94 -100.93
d 40.17 -141.12
e 33.52     nan
g   nan    6.91
f   nan   19.81
h   nan   -8.54

In [107]:
s1.reset_index(drop=True) # delete index

0   69.62
1   32.87
2   92.94
3   40.17
4   33.52
dtype: float64

In [109]:
df1 = pd.DataFrame(np.random.rand(3,2)*10, columns=['a','b'])

In [110]:
df1

     a    b
0 5.84 9.44
1 9.25 0.94
2 7.30 1.40

In [114]:
df2 = pd.DataFrame(np.random.randn(3,2)*10, columns=['a','b'], index=[2,3,4])
df2

       a     b
2   3.91 -7.42
3   3.75 -5.00
4 -12.55 -0.27

In [115]:
pd.concat([df1,df2])

       a     b
0   5.84  9.44
1   9.25  0.94
2   7.30  1.40
2   3.91 -7.42
3   3.75 -5.00
4 -12.55 -0.27

In [116]:
pd.concat([df1,df2], axis=1)

     a    b      a     b
0 5.84 9.44    nan   nan
1 9.25 0.94    nan   nan
2 7.30 1.40   3.91 -7.42
3  nan  nan   3.75 -5.00
4  nan  nan -12.55 -0.27

In [117]:
pd.concat([df1,df2], axis=1, join='inner')

     a    b    a     b
2 7.30 1.40 3.91 -7.42

In [120]:
pd.concat([
           df1.reset_index(drop=True),
           df2.reset_index(drop=True)
          ], 
          axis=1
          )

     a    b      a     b
0 5.84 9.44   3.91 -7.42
1 9.25 0.94   3.75 -5.00
2 7.30 1.40 -12.55 -0.27

In [121]:
pd.concat([
           df1.reset_index(drop=True),
           df2.reset_index(drop=True)
          ], 
          axis=0
          )

       a     b
0   5.84  9.44
1   9.25  0.94
2   7.30  1.40
0   3.91 -7.42
1   3.75 -5.00
2 -12.55 -0.27

In [122]:
df1.append(df2)

       a     b
0   5.84  9.44
1   9.25  0.94
2   7.30  1.40
2   3.91 -7.42
3   3.75 -5.00
4 -12.55 -0.27

In [123]:
df1.append(df2).append(df2)

       a     b
0   5.84  9.44
1   9.25  0.94
2   7.30  1.40
2   3.91 -7.42
3   3.75 -5.00
4 -12.55 -0.27
2   3.91 -7.42
3   3.75 -5.00
4 -12.55 -0.27

In [124]:
df1.T.append(df2.T).T

     a    b      a     b
0 5.84 9.44    nan   nan
1 9.25 0.94    nan   nan
2 7.30 1.40   3.91 -7.42
3  nan  nan   3.75 -5.00
4  nan  nan -12.55 -0.27

## Merge of DataFrame

In [125]:
df_left = pd.DataFrame(
    {'X':['x0','x1','x2','x3'],
    'W':['w0','w1','w2','w3'],
    'Y':['y0','y1','y2','y3'],
    'Mix':['y2','y3','a2','a3']},
    index = ['y2','y3','a2','a3'])

df_right = pd.DataFrame(
    {'Z':['z2','z3','z4','z5'],
     'A':['a2','a3','a4','a5'],
     'Y':['y2','y3','y4','y5']},
    index = [2,3,4,5])

In [127]:
df_left

     X   W   Y Mix
y2  x0  w0  y0  y2
y3  x1  w1  y1  y3
a2  x2  w2  y2  a2
a3  x3  w3  y3  a3

In [128]:
df_right

    Z   A   Y
2  z2  a2  y2
3  z3  a3  y3
4  z4  a4  y4
5  z5  a5  y5

In [130]:
pd.merge(df_left, df_right)

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

In [132]:
pd.merge(df_left, df_right, how='inner', on='Y')

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

In [133]:
pd.merge(df_left, df_right, how='inner', left_on='Mix', right_on='Y')

    X   W Y_x Mix   Z   A Y_y
0  x0  w0  y0  y2  z2  a2  y2
1  x1  w1  y1  y3  z3  a3  y3

In [134]:
pd.merge(df_left, df_right, how='inner', left_on='Mix', right_on='A')

    X   W Y_x Mix   Z   A Y_y
0  x2  w2  y2  a2  z2  a2  y2
1  x3  w3  y3  a3  z3  a3  y3

![](http://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png)